app/views/scripts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."script_id" = ?  [["script_id", 1]]
---
<h2 style="color:white;">Comments</h2>
<% @script.comments.each do |comment| %>