app/controllers/clips_controller.rb

	def create
		@script = Script.find(params[:script_id])
		@scene = @script.scenes.find(params[:scene_id])
		if @clip = @scene.clips.create(clip_params)
			vids = @scene.numOfVids
			vids = vids + 1
			@scene.numOfVids = vids
			@scene.save
---
SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."script_id" = ? AND "scenes"."id" = ? LIMIT 1  [["script_id", 1], ["id", 1]]
INSERT INTO "clips" ("video_file_name", "video_content_type", "video_file_size", "video_updated_at", "scene_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
UPDATE "scenes" SET "numOfVids" = ?, "updated_at" = ? WHERE "scenes"."id" = ?  [["numOfVids", 1], ["updated_at", "2015-05-22 22:20:27.853056"], ["id", 3]]