app/controllers/comments_controller.rb

SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("commenter", "body", "script_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["commenter", "User"], ["body", "What a great movie!"], ["script_id", 1], ["created_at", "2015-05-20 15:28:50.484598"], ["updated_at", "2015-05-20 15:28:50.484598"]]
---
    def create
    @script = Script.find(params[:script_id])
    @comment = @script.comments.create(comment_params)