app/controllers/scenes_controller.rb

	def show
		@scene = Scene.find(params[:id])
---
SELECT  "scenes".* FROM "scenes" WHERE "scenes"."id" = ? LIMIT 1  [["id", 1]]