app/controllers/scripts_controller.rb

SELECT "scripts".* FROM "scripts"
---
	def index
		@scriptList = Script.all

SELECT  "scripts".* FROM "scripts" WHERE "scripts"."id" = ? LIMIT 1  [["id", 1]]
---
	def show
		@script = Script.find(params[:id])

INSERT INTO "scripts" ("scriptname", "authorid", "genre", "summary", "notes", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
	def create
		@script = Script.new(script_params)
		if @script.save